CREATE DATABASE  IF NOT EXISTS `ezoodb` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `ezoodb`;
-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: localhost    Database: ezoodb
-- ------------------------------------------------------
-- Server version	8.3.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `stores`
--

DROP TABLE IF EXISTS `stores`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `stores` (
  `id` int NOT NULL AUTO_INCREMENT,
  `prodId` int NOT NULL,
  `number` int NOT NULL,
  `producer` varchar(255) NOT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  PRIMARY KEY (`id`),
  KEY `prodId` (`prodId`),
  CONSTRAINT `stores_ibfk_1` FOREIGN KEY (`prodId`) REFERENCES `prods` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=47 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `stores`
--

LOCK TABLES `stores` WRITE;
/*!40000 ALTER TABLE `stores` DISABLE KEYS */;
INSERT INTO `stores` VALUES (1,1,33,'ЗооМастер','2024-03-07 12:24:54','2024-03-07 12:24:54'),(2,2,1,'Пушистый Дом','2024-03-07 12:24:54','2024-03-07 12:24:54'),(3,3,19,'Лапки и Хвостики','2024-03-07 12:24:54','2024-03-07 12:24:54'),(4,4,65,'Хвостатый Мир','2024-03-07 12:24:54','2024-03-07 12:24:54'),(5,5,75,'Пушистое Чудо','2024-03-07 12:24:54','2024-03-07 12:24:54'),(6,6,5,'ЗооСфера','2024-03-07 12:24:54','2024-03-07 12:24:54'),(7,7,12,'ЗооКомфорт','2024-03-07 12:24:54','2024-03-07 12:24:54'),(8,8,4,'Лапочка','2024-03-07 12:24:54','2024-03-07 12:24:54'),(9,9,57,'Пушистые Тропинки','2024-03-07 12:24:54','2024-03-07 12:24:54'),(10,10,89,'ЗооПланета','2024-03-07 12:24:54','2024-03-07 12:24:54'),(11,11,65,'Хвостик и Лапка','2024-03-07 12:24:54','2024-03-07 12:24:54'),(12,12,45,'Пушистый Рай','2024-03-07 12:24:54','2024-03-07 12:24:54'),(13,13,10,'ЗооСклад','2024-03-07 12:24:54','2024-03-07 12:24:54'),(14,14,61,'Лапкина Игрушка','2024-03-07 12:24:54','2024-03-07 12:24:54'),(15,15,84,'Пушистый Корабль','2024-03-07 12:24:54','2024-03-07 12:24:54'),(16,16,99,'ЗооАрт','2024-03-07 12:24:54','2024-03-07 12:24:54'),(17,17,60,'Хвостатый Друг','2024-03-07 12:24:54','2024-03-07 12:24:54'),(18,18,78,'Пушистый Домик','2024-03-07 12:24:54','2024-03-07 12:24:54'),(19,19,20,'ЗооСказка','2024-03-07 12:24:54','2024-03-07 12:24:54'),(20,20,30,'Лапкин Дом','2024-03-07 12:24:54','2024-03-07 12:24:54'),(21,21,81,'ЗооСфера','2024-03-07 12:24:54','2024-03-07 12:24:54'),(22,22,54,'Пушистый Мир','2024-03-07 12:24:54','2024-03-07 12:24:54'),(23,23,14,'ЗооКомфорт','2024-03-07 12:24:54','2024-03-07 12:24:54'),(24,24,62,'Лапочка','2024-03-07 12:24:54','2024-03-07 12:24:54'),(25,25,89,'Пушистое Чудо','2024-03-07 12:24:54','2024-03-07 12:24:54'),(26,26,48,'ЗооПланета','2024-03-07 12:24:54','2024-03-07 12:24:54'),(27,27,6,'Хвостик и Лапка','2024-03-07 12:24:54','2024-03-07 12:24:54'),(28,28,58,'Пушистый Рай','2024-03-07 12:24:54','2024-03-07 12:24:54'),(29,29,79,'ЗооСклад','2024-03-07 12:24:54','2024-03-07 12:24:54'),(30,30,34,'Лапкина Игрушка','2024-03-07 12:24:54','2024-03-07 12:24:54'),(31,31,79,'Пушистый Корабль','2024-03-07 12:24:54','2024-03-07 12:24:54'),(32,32,35,'ЗооАрт','2024-03-07 12:24:54','2024-03-07 12:24:54'),(33,33,94,'Хвостатый Друг','2024-03-07 12:24:54','2024-03-07 12:24:54'),(34,34,86,'Пушистый Домик','2024-03-07 12:24:54','2024-03-07 12:24:54'),(35,35,92,'ЗооСказка','2024-03-07 12:24:54','2024-03-07 12:24:54'),(36,36,71,'Лапкин Дом','2024-03-07 12:24:54','2024-03-07 12:24:54'),(37,37,57,'ЗооСфера','2024-03-07 12:24:54','2024-03-07 12:24:54'),(38,38,36,'Пушистый Мир','2024-03-07 12:24:54','2024-03-07 12:24:54'),(39,39,20,'ЗооКомфорт','2024-03-07 12:24:54','2024-03-07 12:24:54'),(40,40,30,'Лапочка','2024-03-07 12:24:54','2024-03-07 12:24:54'),(41,41,57,'Пушистое Чудо','2024-03-07 12:24:54','2024-03-07 12:24:54'),(42,42,75,'ЗооПланета','2024-03-07 12:24:54','2024-03-07 12:24:54'),(43,43,88,'Хвостик и Лапка','2024-03-07 12:24:54','2024-03-07 12:24:54'),(44,44,0,'Пушистый Рай','2024-03-07 12:24:54','2024-03-07 12:24:54'),(45,45,41,'ЗооСклад','2024-03-07 12:24:54','2024-03-07 12:24:54'),(46,46,54,'Пушистый Корабль','2024-03-07 12:24:54','2024-03-07 12:24:54');
/*!40000 ALTER TABLE `stores` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-03-18  0:46:42
